[Support_Air_Offensive_StrafingRun_A10_T1 X2WeaponTemplate]
FriendlyName="火力支援：A10 精确打击"
FriendlyNamePlural="火力支援：A10 精确打击"
BriefSummary="一台设置了频率的无线电设备，用于在指定区域呼叫火力支援。"
TacticalText="<Bullet/>专门调谐以呼叫特定火力支援的无线电装置。\n<Bullet/>A10 扫射运行：A10 被呼叫并在指定目标区域执行扫射运行。\n<Bullet/>致命准确。\n<Bullet/>不能在地下或大型建筑物或建筑群内使用。"
AbilityDescName="支援打击"


[Ability_Support_Air_Off_StrafingRun_A10_Stage1 X2AbilityTemplate]
LocFriendlyName="请求火力任务：A-10"
;LocLongDescription="<Ability:STRIKE_INTELCOST_USAGE_DYN/>\n请求在目标位置进行延迟精确打击。A-10 将在几圈后进行精确打击。"
LocLongDescription="<Ability:STRIKE_INTELCOST_USAGE_DYN/>\n请求在作战区域执行射击任务。经过几次转弯后，A-10 将可以执行扫射任务或发射任何装备的炮弹。"
LocHelpText="<Ability:STRIKE_INTELCOST_USAGE_DYN/>\n请求任务地点内的 A-10‘雷电 II’执行射击任务。"
LocFlyOverText="请求火力任务：A-10‘雷电 II’"

[Ability_Support_Air_Off_StrafingRun_A10_Stage2 X2AbilityTemplate]
LocFlyOverText="A-10 可执行任务！"

[Ability_Support_Air_Off_StrafingRun_A10_Stage3_InitLocation X2AbilityTemplate]
LocFriendlyName="请求打击：A-10 扫射行动 [地点]"
LocLongDescription="设置扫射运行的初始位置。玩家必须选择一个角度，然后 A10 才能进行扫射运行。"
LocHelpText="设置 A10 扫射跑道的初始位置。玩家必须在此功能激活后立即选择一个角度。"

[Ability_Support_Air_Off_StrafingRun_A10_Stage3_SelectAngle X2AbilityTemplate]
LocFriendlyName="请求打击：A-10 扫射行动 [角度]"
LocHelpText="设置 A-10 扫射的攻击方向。激活该能力将确认打击！"

[]
LocFlyOverText

[Ability_Support_Air_Off_StrafingRun_A10_Stage2 X2AbilityTemplate]
LocFriendlyName="呼叫：A10 打击"
LocLongDescription="当此效果激活时，呼叫 A10 扫射运行。 <Ability:STRIKE_STRAFINGRUN_A10_STAGE2_DURATION/> 左转。"
LocHelpText="当此效果激活时，呼叫 A10 扫射运行。 <Ability:STRIKE_STRAFINGRUN_A10_STAGE2_DURATION/> 左转。"
